Saturday-Vinyl/saturday-vinyl-supabase/s3-master/sdkconfig.defaults
# Saturday Vinyl Hub - ESP32-S3 Master SDK Configuration
# This is the master MCU handling WiFi, BLE, RFID, USB, and H2 management.

# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Project configuration
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash configuration (8MB flash for S3 with OTA support)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# =============================================================================
# FreeRTOS Configuration
# =============================================================================
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3072

# =============================================================================
# Logging
# =============================================================================
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# =============================================================================
# Wi-Fi Configuration
# =============================================================================
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# =============================================================================
# Networking (LwIP)
# =============================================================================
CONFIG_LWIP_LOCAL_HOSTNAME="saturday-hub"
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y

# =============================================================================
# HTTP/HTTPS Client
# =============================================================================
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=y

# =============================================================================
# TLS Certificate Bundle for HTTPS
# =============================================================================
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# =============================================================================
# Bluetooth (NimBLE for BLE Provisioning)
# =============================================================================
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="Saturday Hub"
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=32

# =============================================================================
# USB Configuration (for Service Mode and esp-serial-flasher)
# =============================================================================
# ESP32-S3 has native USB support
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_USB_OTG_SUPPORTED=y

# =============================================================================
# UART Configuration
# =============================================================================
# UART1: RFID Module (YRM100)
# UART2: H2 Communication
CONFIG_UART_ISR_IN_IRAM=y

# =============================================================================
# NVS Storage
# =============================================================================
# NVS encryption (optional, enable for production)
# CONFIG_NVS_ENCRYPTION=y

# =============================================================================
# Watchdog
# =============================================================================
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# =============================================================================
# Power Management
# =============================================================================
CONFIG_PM_ENABLE=n

# =============================================================================
# VFS Configuration (for non-blocking stdin)
# =============================================================================
CONFIG_VFS_SUPPORT_IO=y
CONFIG_VFS_SUPPORT_SELECT=y

# =============================================================================
# Bootloader Configuration
# =============================================================================
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y

# =============================================================================
# HTTPS OTA Configuration
# =============================================================================
CONFIG_ESP_HTTPS_OTA_DECRYPT_CB=n
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# =============================================================================
# System Event Task Stack (increased for complex operations)
# =============================================================================
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
